package eap.abstractfactory;


/*Η κλάση αυτή επεκτείνει την κλάση Phone.
Διαθέτει επιπλέον τα χαρακτηριστικά camera (της δοθείσας αντίστοιχης κλάσης) και το αλφαριθμητικό operatingSystem
Θα πρέπει εντός της υλοποίησής της να υποσκελίσετε (να κάνετε override) τη μέθοδο toString η οποία έχει κληρονομηθεί από την κλάση Phone.
Ωστόσο, στη νέα υλοποίηση της μεθόδου toString Θα πρέπει ο κώδικάς σας να χρησιμοποιεί την κληρονομηθείσα μέθοδο και να συμπληρώνει το
επιστρεφόμενο αποτέλεσμα με τα νέα πεδία που εισήχθησαν στην κλάση SmartPhone.*/

